Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་འཛིན་པ་ལགས།
en: VII: 16} the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas?

source: མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: How do they acquire the thirty-two major marks of a great person and the excellent eighty minor marks?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པ་གང་གཏོང་བ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པར་གཏོང་སྟེ། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ། །ཚུལ་ཁྲིམས་གང་སྲུང་བ་དང་།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, whatever gifts they dispense, they dispense them having been embraced by the perfection of wisdom, and in this they are without dualistic perception.

source: བཟོད་པ་གང་སྒོམ་པ་དང་། བརྩོན་འགྲུས་གང་རྩོམ་པ་དང་། ཏིང་ངེ་འཛིན་གང་ལ་སྙོམས་པར་འཇུག་པ་དང་། ཤེས་རབ་གང་སྒོམ་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པར་སྒོམ་སྟེ། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ།
en: Whatever ethical discipline they keep, whatever tolerance they cultivate, whatever perseverance they undertake, whatever meditative stability they are absorbed in, and whatever wisdom they cultivate, they do so having been embraced by the perfection of wisdom, and in this they are without dualistic perception.

source: །ནང་སྟོང་པ་ཉིད་གང་སྒོམ་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་གང་སྒོམ་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པར་སྒོམ་སྟེ། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ།
en: Whatever aspects of emptiness they cultivate—from the emptiness of internal phenomena up to and including the emptiness of the essential nature of nonentities—they do so having been embraced by the perfection of wisdom, and in this they are without dualistic perception.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་གང་སྒོམ་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པར་སྒོམ་སྟེ། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་
en: Whatever factors conducive to enlightenment they cultivate, they do so having been embraced by the perfection of wisdom, and in this they are without dualistic perception.

source: མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་གང་སྒོམ་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པར་སྒོམ་སྟེ།
en: Whatever truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, gateways of liberation—emptiness, signlessness, and wishlessness—meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, great loving kindness, great compassion, and distinct qualities of the buddhas they cultivate, they do so having been embraced by the perfection of wisdom, and in this they are without dualistic perception.

source: དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ། །མཚན་རྣམས་དང་། དཔེ་བྱད་བཟང་པོ་རྣམས་གང་མངོན་པར་སྒྲུབ་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པར་མངོན་པར་སྒྲུབ་པ་སྟེ། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ། །གསོལ་པ།
en: Whatever major marks and excellent minor marks they actualize, they do so having been embraced by the perfection of wisdom, and in this they are without dualistic perception.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཇི་ལྟར་ན་སྦྱིན་པ་གཏོང་བ་དང་། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་བ་ལགས། ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་དང་།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom how do they dispense gifts, and in this be without dualistic perception?

source: བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་སྒོམ་པ་དང་། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་བ་ལགས།
en: How do they cultivate ethical discipline, tolerance, perseverance, meditative stability, and wisdom, and in this be without dualistic perception?

source: ཇི་ལྟར་ན་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྒོམ་པ་དང་། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་བ་ལགས། ཇི་ལྟར་ན་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: How do they cultivate the emptiness of internal phenomena [and the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and in this be without dualistic perception?

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྒོམ་པ་དང་། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་བ་ལགས། ཇི་ལྟར་ན་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་མངོན་པར་སྒྲུབ་པ་དང་། དེ་ལ་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་བ་ལགས།
en: How do they actualize the thirty-two major marks and the excellent eighty minor marks, and in this be without dualistic perception?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དེར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་འདུས་པར་བྱས་ཤིང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of generosity—that is to say, they complete the perfection of generosity after having integrated all six perfections in that perfection of generosity.

source: །དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེར།
en: They also complete the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, and the perfection of wisdom—that is to say, they complete the perfection of wisdom [and so forth] after having integrated all six perfections in that perfection of wisdom [and so forth]. “

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་འདུས་པར་བྱས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དེར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་ཐམས་ཅད་འདུས་པར་བྱས་ཤིང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: When they practice the perfection of wisdom, they complete the factors conducive to enlightenment— that is to say, they complete the factors conducive to enlightenment after having integrated all six perfections in those factors conducive to enlightenment. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་གང་གི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སྦྱིན་པ་གཏོང་བ་དེའི་ཚེ། ཟག་པ་མེད་པའི་སེམས་ལ་གནས་ཤིང་། སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ།
en: Subhūti, at the time when bodhisattva great beings practice the perfection of wisdom and dispense gifts, they dispense gifts while maintaining a mind that is devoid of contaminants.

source: དེ་ཟག་པ་མེད་པའི་སེམས་དེ་ལ་གནས་པའི་མཚན་མ་དང་། གང་སྦྱིན་པ་དང་། གང་ལ་སྦྱིན་པ་དང་། གང་གིས་སྦྱིན་པ་དང་། གང་ཡོངས་སུ་གཏོང་བ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Indeed, those who maintain a mind that is devoid of contaminants do not observe what is the gift, to whom is it given, by whom is it given, what is the act of giving, or any other mental concept.

source: །དེ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཟག་པ་མེད་ཅིང་སེར་སྣ་དང་བྲལ་བ། ཆགས་སེམས་མེད་པ་དེས་སྦྱིན་པ་གཏོང་སྟེ། དེ་སེམས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They dispense gifts with a mind that is free from concepts, without contaminants, devoid of miserliness, and without attachment, and they do not even observe that mind. {Ki.

source: །ཇི་ལྟར་སེམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་ལྟར་སྦྱིན་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: VII: 17} Just as they do not observe that mind, in the same way they do not observe generosity, nor do they observe anything at all, up to and including all attributes. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། ཚུལ་ཁྲིམས་སྲུང་བའི་ཚེ། ཚུལ་ཁྲིམས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom and maintain ethical discipline with a mind that is free from concepts, they do not observe that ethical discipline, nor do they observe anything at all, up to and including all attributes. “

source: བམ་པོ་དྲུག་ཅུ་ལྔ་པ། རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་བཟོད་པ་སྒོམ་པའི་ཚེ། བཟོད་པ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom and cultivate tolerance with a mind that is free from concepts, they do not observe that tolerance, nor do they observe anything at all, up to and including all attributes. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། བརྩོན་འགྲུས་རྩོམ་པའི་ཚེ། བརྩོན་འགྲུས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom and undertake perseverance with a mind that is free from concepts, they do not observe that perseverance, nor do they observe anything at all, up to and including all attributes. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པའི་ཚེ། ཏིང་ངེ་འཛིན་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom and are absorbed in meditative stability with a mind that is free from concepts, they do not observe that mental stability, nor do they observe anything at all, up to and including all attributes. “

source: མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་ཤེས་རབ་སྒོམ་པའི་ཚེ། ཤེས་རབ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom and cultivate wisdom with a mind that is free from concepts, they do not observe that wisdom, nor do they observe anything at all, up to and including all attributes. “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་མངོན་པར་སྒྲུབ་པའི་ཚེ། ཆོས་དེ་དག་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, and with a mind that is free from concepts actualize the emptiness of internal phenomena [and the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, great loving kindness, great compassion, the thirty-two major marks, and the excellent eighty minor marks, they do not observe those attributes, nor do they observe anything at all, up to and including all those attributes.” {

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཆོས་ཐམས་ཅད་མཚན་མ་མ་མཆིས་པ་དང་། བགྱིད་པ་མ་མཆིས་པ་དང་། དམིགས་པ་མ་མཆིས་པ་དང་། མངོན་པར་འདུ་བགྱི་བ་མ་མཆིས་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལགས།
en: VII: 18} Subhūti then asked, “Blessed Lord, since all phenomena are without concepts, uneffected, unapprehended, and unconditioned, how do bodhisattva great beings complete the perfection of generosity?

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལགས། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: How do they complete the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, and the perfection of wisdom?

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: How do they complete the emptiness of internal phenomena [and the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས་སྦྱིན་པ་གཏོང་བ་ཡིན་ཏེ། བཟའ་བ་དང་། བཏུང་བ་དང་། བགོ་བ་དང་། བཞོན་པ་དང་། མལ་ཆ་དང་། གནས་དང་། ཁྱིམ་དང་། ནོར་དང་། འབྲུ་དང་། དབྱིག་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they dispense generosity with a mind that is free from concepts concerning all phenomena that are signless, uneffected, unapprehended, and unconditioned.

source: བཻ་ཌཱུརྱ་དང་དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་ས་ལེ་སྦྲམ་དང་དངུལ་དང་མིའི་ཡོ་བྱད་གང་ཡང་རུང་བའི་བར་དག་དང་ཆུང་མ་དང་བུ་དང་བུ་མོ་འམ། ཕྱི་དང་ནང་ངམ་ཡན་ལག་དང་ཉིང་ལག་དང་། རྒྱལ་སྲིད་ཀྱང་རུང་རྒྱན་གྱིས་བརྒྱན་ཅིང་།
en: They dispense to those who ask for them food, drink, clothing, transport, bedding, lodging, houses, riches, grain, precious jewels, gold, gems, pearls, beryl, conch, quartz, coral, pure gold, and silver, up to all other resources suitable for humankind, including wives, sons, daughters, and [necessities] external and internal, ancillary and subsidiary, as well as kingdoms, whichever are appropriate, embellished with ornaments.

source: སློང་བ་རྣམས་ལ་ཡོངས་སུ་གཏོང་སྟེ། གལ་ཏེ་དེའི་དྲུང་དུ་ལ་ལ་ཞིག་འོངས་ཤིང་། འདི་སྐད་དུ་ཁྱོད་ཀྱི་སྦྱིན་པ་དེ་ལྟ་བུར། དེ་ལྟར་ཕན་པ་མེད་པ། མི་བརྟན་པ་ཡོངས་སུ་བཏང་བ་དེས་ཅི་ཞིག་བྱ་ཞེས་ཟེར་ན།
en: If someone were to come near and say to them, ‘What is the point of dispensing such gifts of yours, which are useless and ephemeral?’

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་བདག་ལ་སེམས་ཅན་འདི་དག་ཁྱོད་ཀྱི་སྦྱིན་པ་དེ་ལྟར་ཕན་པ་མེད་པ། མི་བརྟན་པ་ཡོངས་སུ་བཏང་བ་དེས་ཅི་ཞིག་བྱ་ཞེས་ཟེར་མོད་ཀྱི། འོན་ཀྱང་བདག་གིས་སྦྱིན་པ་ཡོངས་སུ་བཏང་བར་བྱའི། བདག་གིས་སྦྱིན་པ་མི་སྦྱིན་པར་མི་བྱའོ་སྙམ་ནས།
en: at that [time] when bodhisattva great beings practice the perfection of wisdom they would think, ‘Although these beings say to me, “What is the point of dispensing such gifts of yours, which are useless and ephemeral,” even so I should dispense gifts; I should not not dispense gifts!’

source: དེ་སྦྱིན་པ་དེ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ། ཅི་ནས་ཀྱང་ཡོངས་སུ་བསྔོ་བའི་ཚེ། གང་སྦྱིན་པ་དང་། གང་ལ་སྦྱིན་པ་དང་། གང་གིས་སྦྱིན་པ་དང་། སུ་ཡོངས་སུ་གཏོང་བ་དང་། ཅི་ཡོངས་སུ་གཏོང་བ་དང་། སུ་ཅི་ཡོངས་སུ་གཏོང་བ་དང་།
en: And then, making common cause with all beings, they would dedicate those gifts to unsurpassed, complete enlightenment.

source: ཅི་ཡོངས་སུ་བསྔོ་བ་དང་། གང་ལ་ཡོངས་སུ་བསྔོ་བ་དང་། གང་གིས་ཡོངས་སུ་བསྔོ་བ་དང་། སུ་ཡོངས་སུ་བསྔོ་བ་དང་། ཅི་ཡོངས་སུ་བསྔོ་བ་དང་།
en: When they make this dedication, by all means they do so without considering what is the gift, for whom is the gift, whose is the gift, what is being dispensed, for whom is it being dispensed, who is dispensing, what is being dedicated, to whom is it being dedicated, by whom is it being dedicated, or any such concepts.

source: གང་ལ་ཡོངས་སུ་བསྔོ་བའི་མཚན་མ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ།
en: They do not observe any such entity {Ki.

source: དེ་གང་གཏོང་བ་དང་། གང་གི་ཕྱིར་བཏང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་དེ་ལྟ་བུའི་དངོས་པོ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: VII: 19} that they would dispense, or with respect to which, having been dispensed, they would make a dedication toward unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དངོས་པོ་ཐམས་ཅད་ནི་ནང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་ཕྱི་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ཀྱིས་སྟོང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱིས་སྟོང་ངོ་།
en: If you ask why, it is because all entities are empty in accordance with the emptiness of internal phenomena, empty in accordance with the emptiness of external phenomena, empty in accordance with the emptiness of external and internal phenomena, and empty in accordance with [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དེས་དེ་ལྟར་ཆོས་ཐམས་ཅད་སྟོང་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ན། ཅི་ཞིག་ཡོངས་སུ་བསྔོ་བར་འགྱུར། གང་ལ་ཡོངས་སུ་བསྔོ་བར་འགྱུར། གང་གིས་ཡོངས་སུ་བསྔོ་བར་འགྱུར་ཏེ།
en: So when they observe all phenomena to be empty, what would be dedicated, to whom would the dedication be made, and by whom would the dedication be made?

source: དེའི་བསྔོ་བ་དེ་ལྟ་བུ་ནི་བསྔོ་བའི་དམ་པ་ཡིན། དུག་མེད་པའི་བསྔོ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་བསྔོ་བ་ཡིན་ཏེ།
en: Dedications such as this are the best of dedications; they are unpoisoned dedications in accord with the realm of phenomena. “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པ་དང་། བྱེད་པ་མེད་པ་དང་། དམིགས་སུ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཏོ།
en: Subhūti, when these bodhisattva great beings practice the perfection of wisdom, they bring beings to maturity and acquire the buddhafields in that all phenomena are signless, uneffected, unapprehended, unoriginated, and unconditioned.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They complete the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They complete the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, and the perfection of wisdom.

source: །སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་།
en: They complete all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas. “

source: སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དེ་ཐོག་མ་ཉིད་དུ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཀྱང་རྣམ་པར་སྨིན་པ་ཡོངས་སུ་མི་འཛིན་ཏེ། འོན་ཀྱང་དེའི་ཡོ་བྱད་བསམས་པ་ཙམ་གྱིས་འགྲུབ་བོ།
en: Although they complete the perfection of generosity from the start, they do not accept any ripening [of past actions]— and yet resources nevertheless materialize for them just by their so wishing.

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ནི་བསམས་པ་ཙམ་གྱིས་འབྱུང་ངོ་།
en: Subhūti, this is just like when all the excellent resources of the gods of the Para­nirmita­vaśa­vartin realm arise just by their so wishing.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱང་བསམས་པ་ཙམ་གྱིས་འབྱུང་ངོ་།
en: In the same way, Subhūti, all the excellent resources of bodhisattva great beings, too, arise just by their so wishing.

source: །དེ་ཡོ་བྱད་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཡང་བསྙེན་བཀུར་བྱེད་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཡང་ཚིམ་པར་བྱས་སོ།
en: Through these resources they venerate the lord buddhas and also satisfy the world with its gods, humans, and asuras.
